rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'David'
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = 'David'
---
def same_director
    movie = Movie.find(params[:id])
    director_name = movie.director

    if not director_name or director_name.empty?
      flash[:notice] = %Q{'#{movie.title}' has no director info}
      redirect_to movies_path
    else
	 @movies = Movie.similar_directors(director_name)
      flash[:notice] = %Q{There are #{@movies.size} movie(s) with "#{director_name}" as director}